"""
Дан список чисел numbers. Найдите все элементы списка, которые больше предыдущего элемента. Результат положите в cписок result
"""


numbers = [389, 372, 941, 739, 447, 525, 623, 583, 959, 372, 736, 299, 366, 444, 94, 109, 151, 411, 106, 998, 444, 239,
           731, 789, 177, 934, 104, 987, 82, 123, 5, 236, 587, 414, 736, 184, 39, 720, 111, 798, 981, 977, 35, 478,
           610, 973, 140, 502, 289, 572, 132, 139, 633, 63, 103, 649, 658, 149, 899, 312, 626, 720, 776, 249, 203, 396,
           716, 273, 959, 554, 726, 294, 925, 594, 541, 261, 432, 799, 192, 58, 587, 729, 727, 692, 465, 167, 886, 477,
           600, 797, 324, 662, 664, 301, 935, 192, 528, 203, 699, 710]

def find_all_elements(numbers):
    result_list = []
    i = 1
    length = len(numbers)
    while i < length:
        if numbers[i] > numbers[i - 1]:
            result_list.append(numbers[i])
        i += 1
    return result_list

result = find_all_elements(numbers)
print(numbers)
print(result)
